{
  "main": {
    "name":"Shiv Palit",
    "description":"I am a data scientist with professional experience building large-scale ML/AI solutions, developing data platforms, and driving customer experience analytics across media, consulting, and investment sectors",
    "image":"profilepic.jpeg",
    "bio":"I'm a data scientist with a product mindset, passionate about building scalable AI/ML solutions that unlock insights and drive impact. Currently at Warner Bros. Discovery, I lead the development of machine learning models and data platforms that power customer experience analytics across global streaming brands. I enjoy working at the intersection of data engineering, modeling, and product strategy - translating messy real-world problems into clean, efficient systems.\n\nMy primary toolkit includes Python, Docker, and AWS. I'm especially comfortable working with LLMs, clustering & classification algorithms, and streamlining complex pipelines. I love designing intuitive tools that make data accessible to everyone, from analysts to executives. \n\nCurious by nature and collaborative by default, I thrive in fast-paced environments where I can work cross-functionally, mentor others, and continuously learn. Whether it's scaling up a data platform or experimenting with a new model architecture, I'm always looking for ways to make data more actionable and impactful.",
    "contactmessage":"To learn more about me, please reach out!",
    "email": "shivpalit@gmail.com",
    "phone": "912-334-6950",
    "github":"https://github.com/shivpalit",
    "linkedin":"https://www.linkedin.com/in/shivpalit/",
    "address":{
      "street":"(Your Street)",
      "city":"(Your City)",
      "state":"(Your State)",
      "zip": "(Your Zip/Postal Code)"
    },
    "resumedownload":"./documents/ShivPalitResume.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/shivpalit/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/shivpalit",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Here you can create a short write-up of your skills to show off to employers",
    "education":[
      {
        "school":"Johns Hopkins University",
        "degree":"M.S. in Data Science",
        "graduated":"2022 - 2025",
        "description":"<strong>Relevant Coursework:</strong> Data Engineering Principles & Practice, Graph Theory, Information Retrieval, Intro to Machine Learning, Probability & Stochastic Processes, Statistical Models & Regression"
      },
      {
        "school":"Davidson College",
        "degree":"B.A. in Economics, Minor in Data Science",
        "graduated":"2015 - 2019",
        "description":"<strong>Relevant Coursework:</strong> Applied Research Design & Data Analysis, Data Science, Data Structures, Econometrics, Financial Economics, Macroeconomics, Microeconomics, Programming & Problem Solving, Statistics & Basic Econometrics"
      }
    ],
    "work":[
      {
        "company": "Warner Bros. Discovery",
        "title": "Senior Product Manager, CX Data & AI",
        "years": "June 2023 - Present",
        "description": "Lead Warner Bros. Discovery’s CX Data & AI organization, overseeing all CX data products and enterprise AI tools across major brands. Manage multiple engineering teams to deliver scalable ML/AI solutions and real-time analytics from 10K+ daily customer contacts. Architected LLM-based classifiers and clustering models, achieving up to $1.5M in operational savings annually. Built infrastructure with Airflow, Databricks, and Looker to support executive decisions. Implementing WBD’s first customer-facing GenAI assistant and shaping responsible AI standards in collaboration with Legal and Privacy teams."
      },
      {
        "company": "DAS42",
        "title": "Associate Analytics Consultant",
        "years": "October 2021 - June 2023",
        "description": "Led implementation of Looker BI platform for B2C services client, driving 285% subscription revenue growth through advanced data modeling and analytics. Developed comprehensive subscription analytics and forecasting models using SQL and Python, while partnering with executive leadership to define KPIs and optimize data infrastructure. Directed integration of multiple data sources into centralized warehouse using GCP and Airflow."
      },
      {
        "company": "Pura Vida Investments",
        "title": "Data Science Engineer",
        "years": "August 2020 - October 2021",
        "description": "Engineered automated ETL pipelines and analytics dashboards processing 100K+ daily data points from 25+ alternative sources, saving analysts 6 hours daily. Developed clustering algorithms and sentiment analysis tools to identify trading patterns and track public opinion on portfolio companies. Created proprietary Bloomberg application for analyzing forward valuation metrics and monitoring business activity through non-traditional data sources."
      }
    ],
    "certifications":[
      {
        "name": "Apache Airflow Fundamentals",
        "issuer": "Astronomer",
        "issued": "Issued November 2022",
        "description": "Proficient in creating, managing, and monitoring DAGs and tasks on Apache Airflow."
      },
      {
        "name": "LookML Developer",
        "issuer": "Looker",
        "issued": "Issued November 2022",
        "description": "Proficient in model management, data security requirements, LookML objects, and maintaining LookML project health."
      },
      {
        "name": "SnowPro Core",
        "issuer": "Snowflake",
        "issued": "Issued April 2022",
        "description": "Proficient in cloud data warehousing and necessary knowledge to design, develop, and manage secure, scalable Snowflake solutions."
      }
    ]
  }
}
